
/**
 * 2016/3/23 16:59:24
 * 邱老师 2016/3/23 16:59:24
 * 1. 去空行，不是去前后空格*********************************************
 * 2. 双引号或者单引号内的注释保留*****************************************
 * 3. 使用命令行方式，不使用交互方式****************************************
 * 4. 增加一个是否子目录递归的参数，默认不递归*********************************
 * 5. 如果递归，判断输出目录是否是输入目录的子目录，是则不允许***********************
 * 
 */
/**
 * 
 * @author		Administrator
 * @author		wgc
 * @version		3.x
 * @user		Eliminate the annotation and blank lines		
 * 
 */
/**
 * 
 */
/**
 * @author Administrator
 *
 */
package wgcwgcwgc;